# Даны два целых числа: A, B. Проверить истинность высказывания: «Каждое из чисел
# A и B нечетное».

A = input('Введите целое число A: ')
B = input('Введите целое число B: ')
k = 0
c = 0
d = 0
try:
    A = int(A)
    B = int(B)

    if A % 2 == 0:
        k = A // 2
        print('Число A является чётным')
    else:
        print('Число A является нечётным')
        c = c + 1

    if B % 2 == 0:
        k = B // 2
        if A % 2 == 0:
            K = A // 2
            print('Число B является чётным')
    else:
        print('Число B является нечётным')
        d = d + 1

    if c == 1 or d == 1:

        print('Числа нечетные!')

    else:

        print('Числа четные!')


except ValueError:
    print("Что то пошло не так")

