# Даны два целых числа: A, B. Проверить истинность высказывания: «Каждое из чисел
# A и B нечетное».

A = input('Введите целое число')
B = input ('Введите целое число')
k = 0
try:
    A = int(A)
    B = int(B)
    if A % 2 ==0:
        k = A // 2
    else:
        print(f'Число A = {A} является нечётным')
        print(f'Число B = {B} является чётным')
    if B % 2 == 0:
        k = B // 2
        if A % 2 ==0:
            K = A // 2
    else:
        print(f"Число A нечётное - число B чётное")
        print(f"Числа A и B нечётные")
except:
    print("Что то пошло не так")
finally:
    print("Программа закончена")


